#docker build -t web-server . && docker run -d -p 8080:8080 web-server

# Используем готовый образ Golang версии 1.21.1 как основу для нашего контейнера
FROM golang:1.21.1

# Устанавливаем рабочую директорию в корень контейнера
WORKDIR /

# Копируем все файлы из текущей директории (вашего проекта) в корневую директорию контейнера
COPY . /



# Собираем ваш Go-проект (компилируем) с помощью команды go build и файлом main.go в корень контейнер
# !!! возможно запускаем макфайл с новой командой
RUN go build main.go

# Указываем команду, которая будет выполняться при запуске контейнера
# Измеенить имя запускаюшего файла, например, appScript
CMD ["./main"]

# Открываем порт 8080, чтобы контейнер мог принимать входящие сетевые запросы на этом порту
EXPOSE 8080